## Plan Result (1112: sbox_aria - Terraform Plan Apply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 12 to add, 5 to change, 42 to destroy.</code></pre>

* Create
  * azurerm_application_insights.test[&#34;00&#34;]
  * azurerm_application_insights.test[&#34;01&#34;]
  * azurerm_application_insights.test[&#34;02&#34;]
  * azurerm_linux_function_app.test[&#34;00&#34;]
  * azurerm_linux_function_app.test[&#34;01&#34;]
  * azurerm_linux_function_app.test[&#34;02&#34;]
  * azurerm_service_plan.test[&#34;00&#34;]
  * azurerm_service_plan.test[&#34;01&#34;]
  * azurerm_service_plan.test[&#34;02&#34;]
  * local_file.config[&#34;00&#34;]
  * local_file.config[&#34;01&#34;]
  * local_file.config[&#34;02&#34;]
* Update
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;01&#34;]
  * azurerm_private_dns_zone_virtual_network_link.webapps[&#34;02&#34;]
  * azurerm_private_endpoint.functionapp[&#34;01&#34;]
  * azurerm_private_endpoint.functionapp[&#34;02&#34;]
  * azurerm_private_endpoint.functionapp00[&#34;00&#34;]
* Delete
  * azurerm_linux_function_app.example[&#34;00-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;00-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;01-af-td&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfpa&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-aplfta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-apluta&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-bails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-joh&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-sbails&#34;]
  * azurerm_linux_function_app.example[&#34;02-af-td&#34;]
  * azurerm_service_plan.example[&#34;00-af-aplfpa&#34;]
  * azurerm_service_plan.example[&#34;00-af-aplfta&#34;]
  * azurerm_service_plan.example[&#34;00-af-apluta&#34;]
  * azurerm_service_plan.example[&#34;00-af-bails&#34;]
  * azurerm_service_plan.example[&#34;00-af-joh&#34;]
  * azurerm_service_plan.example[&#34;00-af-sbails&#34;]
  * azurerm_service_plan.example[&#34;00-af-td&#34;]
  * azurerm_service_plan.example[&#34;01-af-aplfpa&#34;]
  * azurerm_service_plan.example[&#34;01-af-aplfta&#34;]
  * azurerm_service_plan.example[&#34;01-af-apluta&#34;]
  * azurerm_service_plan.example[&#34;01-af-bails&#34;]
  * azurerm_service_plan.example[&#34;01-af-joh&#34;]
  * azurerm_service_plan.example[&#34;01-af-sbails&#34;]
  * azurerm_service_plan.example[&#34;01-af-td&#34;]
  * azurerm_service_plan.example[&#34;02-af-aplfpa&#34;]
  * azurerm_service_plan.example[&#34;02-af-aplfta&#34;]
  * azurerm_service_plan.example[&#34;02-af-apluta&#34;]
  * azurerm_service_plan.example[&#34;02-af-bails&#34;]
  * azurerm_service_plan.example[&#34;02-af-joh&#34;]
  * azurerm_service_plan.example[&#34;02-af-sbails&#34;]
  * azurerm_service_plan.example[&#34;02-af-td&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_insights.test["00"] will be created
  + resource "azurerm_application_insights" "test" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "uksouth"
      + name                                = "test-appinsights"
      + resource_group_name                 = "ingest00-main-sbox"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workspace_id                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-sbox"
    }

  # azurerm_application_insights.test["01"] will be created
  + resource "azurerm_application_insights" "test" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "uksouth"
      + name                                = "test-appinsights"
      + resource_group_name                 = "ingest01-main-sbox"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workspace_id                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest01-logAnalytics001-sbox"
    }

  # azurerm_application_insights.test["02"] will be created
  + resource "azurerm_application_insights" "test" {
      + app_id                              = (known after apply)
      + application_type                    = "web"
      + connection_string                   = (sensitive value)
      + daily_data_cap_in_gb                = 100
      + disable_ip_masking                  = false
      + force_customer_storage_for_profiler = false
      + id                                  = (known after apply)
      + instrumentation_key                 = (sensitive value)
      + internet_ingestion_enabled          = true
      + internet_query_enabled              = true
      + local_authentication_disabled       = false
      + location                            = "uksouth"
      + name                                = "test-appinsights"
      + resource_group_name                 = "ingest02-main-sbox"
      + retention_in_days                   = 90
      + sampling_percentage                 = 100
      + tags                                = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + workspace_id                        = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest02-logAnalytics001-sbox"
    }

  # azurerm_linux_function_app.example["00-af-aplfpa"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "BUILD_FLAGS"                                           = "UseExpressBuild"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"              = (sensitive value)
          - "WEBSITE_CONTENTOVERVNET"                               = "1"
          - "WEBSITE_CONTENTSHARE"                                  = "af-aplfpa-sbox00-uks-dlrm-01"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = (sensitive value)
          - "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-aplfpa-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = true -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfpa-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-aplfpa-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.117.217.212",
          - "20.26.58.21",
          - "20.26.60.2",
          - "20.26.60.196",
          - "20.26.60.226",
          - "51.140.84.145",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.140.60.161,51.140.61.32,51.140.68.240,51.140.64.162,51.140.177.236,51.140.46.202,51.132.208.31,20.49.154.81,20.77.142.8,20.77.142.177,20.77.143.19,20.77.143.34,20.108.90.121,20.117.217.212,20.26.58.21,20.26.60.2,20.26.60.196,20.26.60.226,51.140.84.145" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest00-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfpa-sbox00-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (6 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "faf0a92d-ffa3-4dd7-85b8-6b24f7569125" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "FtpsOnly" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
          - minimum_tls_version                           = "1.2" -> null
          - pre_warmed_instance_count                     = 0 -> null
          - remote_debugging_enabled                      = false -> null
          - runtime_scale_monitoring_enabled              = false -> null
          - scm_ip_restriction_default_action             = "Allow" -> null
          - scm_minimum_tls_version                       = "1.2" -> null
          - scm_type                                      = "None" -> null
          - scm_use_main_ip_restriction                   = false -> null
          - use_32_bit_worker                             = false -> null
          - vnet_route_all_enabled                        = true -> null
          - websockets_enabled                            = false -> null
          - worker_count                                  = 1 -> null
            # (7 unchanged attributes hidden)

          - application_stack {
              - python_version              = "3.11" -> null
              - use_custom_runtime          = false -> null
              - use_dotnet_isolated_runtime = false -> null
                # (4 unchanged attributes hidden)
            }
        }
    }

  # azurerm_linux_function_app.example["00-af-aplfta"] will be destroyed
  # (because azurerm_linux_function_app.example is not in configuration)
  - resource "azurerm_linux_function_app" "example" {
      - app_settings                                   = {
          - "AzureWebJobsFeatureFlags"                              = "EnableWorkerIndexing"
          - "BUILD_FLAGS"                                           = "UseExpressBuild"
          - "ENABLE_ORYX_BUILD"                                     = "true"
          - "ENVIRONMENT"                                           = "sbox"
          - "FUNCTIONS_WORKER_RUNTIME"                              = "python"
          - "LZ_KEY"                                                = "00"
          - "PYTHON_ENABLE_WORKER_EXTENSIONS"                       = "1"
          - "SCM_DO_BUILD_DURING_DEPLOYMENT"                        = "1"
          - "WEBSITE_CONTENTAZUREFILECONNECTIONSTRING"              = (sensitive value)
          - "WEBSITE_CONTENTOVERVNET"                               = "1"
          - "WEBSITE_CONTENTSHARE"                                  = "af-aplfta-sbox00-uks-dlrm-01"
          - "WEBSITE_RUN_FROM_PACKAGE"                              = (sensitive value)
          - "XDG_CACHE_HOME"                                        = "/tmp/.cache"
          - "sboxdlrmeventhubns_RootManageSharedAccessKey_EVENTHUB" = (sensitive value)
        } -> null
      - builtin_logging_enabled                        = true -> null
      - client_certificate_enabled                     = false -> null
      - client_certificate_mode                        = "Optional" -> null
      - content_share_force_disabled                   = false -> null
      - custom_domain_verification_id                  = (sensitive value) -> null
      - daily_memory_time_quota                        = 0 -> null
      - default_hostname                               = "af-aplfta-sbox00-uks-dlrm-01.azurewebsites.net" -> null
      - enabled                                        = true -> null
      - ftp_publish_basic_authentication_enabled       = true -> null
      - functions_extension_version                    = "~4" -> null
      - https_only                                     = true -> null
      - id                                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/sites/af-aplfta-sbox00-uks-dlrm-01" -> null
      - key_vault_reference_identity_id                = "SystemAssigned" -> null
      - kind                                           = "functionapp,linux" -> null
      - location                                       = "uksouth" -> null
      - name                                           = "af-aplfta-sbox00-uks-dlrm-01" -> null
      - outbound_ip_address_list                       = [
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.140.84.145",
        ] -> null
      - outbound_ip_addresses                          = "51.140.177.236,51.140.46.202,51.140.84.145" -> null
      - possible_outbound_ip_address_list              = [
          - "51.140.60.161",
          - "51.140.61.32",
          - "51.140.68.240",
          - "51.140.64.162",
          - "51.140.177.236",
          - "51.140.46.202",
          - "51.132.208.31",
          - "20.49.154.81",
          - "20.77.142.8",
          - "20.77.142.177",
          - "20.77.143.19",
          - "20.77.143.34",
          - "20.108.90.121",
          - "20.117.217.212",
          - "20.26.58.21",
          - "20.26.60.2",
          - "20.26.60.196",
          - "20.26.60.226",
          - "51.140.84.145",
        ] -> null
      - possible_outbound_ip_addresses                 = "51.140.60.161,51.140.61.32,51.140.68.240,51.140.64.162,51.140.177.236,51.140.46.202,51.132.208.31,20.49.154.81,20.77.142.8,20.77.142.177,20.77.143.19,20.77.143.34,20.108.90.121,20.117.217.212,20.26.58.21,20.26.60.2,20.26.60.196,20.26.60.226,51.140.84.145" -> null
      - public_network_access_enabled                  = true -> null
      - resource_group_name                            = "ingest00-main-sbox" -> null
      - service_plan_id                                = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfta-sbox00-uks-dlrm-01" -> null
      - site_credential                                = (sensitive value) -> null
      - storage_uses_managed_identity                  = false -> null
      - tags                                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - virtual_network_backup_restore_enabled         = false -> null
      - virtual_network_subnet_id                      = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-data-product-001-sbox" -> null
      - vnet_image_pull_enabled                        = false -> null
      - webdeploy_publish_basic_authentication_enabled = true -> null
        # (6 unchanged attributes hidden)

      - identity {
          - identity_ids = [] -> null
          - principal_id = "4e88e83c-6ee0-4109-b5ec-3f24145dfe4e" -> null
          - tenant_id    = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
          - type         = "SystemAssigned" -> null
        }

      - site_config {
          - always_on                                     = true -> null
          - app_scale_limit                               = 0 -> null
          - application_insights_connection_string        = (sensitive value) -> null
          - container_registry_use_managed_identity       = false -> null
          - default_documents                             = [
              - "Default.htm",
              - "Default.html",
              - "Default.asp",
              - "index.htm",
              - "index.html",
              - "iisstart.htm",
              - "default.aspx",
              - "index.php",
            ] -> null
          - detailed_error_logging_enabled                = false -> null
          - elastic_instance_minimum                      = 1 -> null
          - ftps_state                                    = "FtpsOnly" -> null
          - health_check_eviction_time_in_min             = 0 -> null
          - http2_enabled                                 = false -> null
          - ip_restriction_default_action                 = "Allow" -> null
          - linux_fx_version                              = "PYTHON|3.11" -> null
          - load_balancing_mode                           = "LeastRequests" -> null
          - managed_pipeline_mode                         = "Integrated" -> null
        

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

riptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-joh-sbox01-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-joh-sbox01-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest01-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["01-af-sbails"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-sbails-sbox01-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-sbails-sbox01-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest01-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["01-af-td"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest01-main-sbox/providers/Microsoft.Web/serverFarms/af-td-sbox01-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-td-sbox01-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest01-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["02-af-aplfpa"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfpa-sbox02-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-aplfpa-sbox02-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest02-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["02-af-aplfta"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-aplfta-sbox02-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-aplfta-sbox02-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest02-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["02-af-apluta"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-apluta-sbox02-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-apluta-sbox02-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest02-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["02-af-bails"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-bails-sbox02-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-bails-sbox02-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest02-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["02-af-joh"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-joh-sbox02-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-joh-sbox02-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest02-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["02-af-sbails"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-sbails-sbox02-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-sbails-sbox02-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest02-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.example["02-af-td"] will be destroyed
  # (because azurerm_service_plan.example is not in configuration)
  - resource "azurerm_service_plan" "example" {
      - id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest02-main-sbox/providers/Microsoft.Web/serverFarms/af-td-sbox02-uks-dlrm-01" -> null
      - kind                            = "elastic" -> null
      - location                        = "uksouth" -> null
      - maximum_elastic_worker_count    = 1 -> null
      - name                            = "af-td-sbox02-uks-dlrm-01" -> null
      - os_type                         = "Linux" -> null
      - per_site_scaling_enabled        = false -> null
      - premium_plan_auto_scale_enabled = false -> null
      - reserved                        = true -> null
      - resource_group_name             = "ingest02-main-sbox" -> null
      - sku_name                        = "EP1" -> null
      - tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "3000-01-01"
        } -> null
      - worker_count                    = 1 -> null
      - zone_balancing_enabled          = false -> null
        # (1 unchanged attribute hidden)
    }

  # azurerm_service_plan.test["00"] will be created
  + resource "azurerm_service_plan" "test" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "functionapp-test"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "ingest00-main-sbox"
      + sku_name                        = "EP1"
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + worker_count                    = (known after apply)
    }

  # azurerm_service_plan.test["01"] will be created
  + resource "azurerm_service_plan" "test" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "functionapp-test"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "ingest01-main-sbox"
      + sku_name                        = "EP1"
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + worker_count                    = (known after apply)
    }

  # azurerm_service_plan.test["02"] will be created
  + resource "azurerm_service_plan" "test" {
      + id                              = (known after apply)
      + kind                            = (known after apply)
      + location                        = "uksouth"
      + maximum_elastic_worker_count    = (known after apply)
      + name                            = "functionapp-test"
      + os_type                         = "Linux"
      + per_site_scaling_enabled        = false
      + premium_plan_auto_scale_enabled = false
      + reserved                        = (known after apply)
      + resource_group_name             = "ingest02-main-sbox"
      + sku_name                        = "EP1"
      + tags                            = {
          + "application"  = "dlrm-data-ingest"
          + "builtFrom"    = "hmcts/dlrm-data-ingest-aria"
          + "businessArea" = "cross-cutting"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + worker_count                    = (known after apply)
    }

  # local_file.config["00"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "00"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_00.json"
      + id                   = (known after apply)
    }

  # local_file.config["01"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "01"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_01.json"
      + id                   = (known after apply)
    }

  # local_file.config["02"] will be created
  + resource "local_file" "config" {
      + content              = jsonencode(
            {
              + env = "sbox"
              + lz  = "02"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./tmp/config_sbox_02.json"
      + id                   = (known after apply)
    }

Plan: 12 to add, 5 to change, 42 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":142,"Program":"tfcmt","SHA1":"","Target":"1112: sbox_aria - Terraform Plan Apply","Vars":{}} -->